Revit 2027 API
BuiltInFailures.GeneralFailures.GenericErrorNone Property
 None.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GenericErrorNone { get; }
Public Shared ReadOnly Property GenericErrorNone As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GenericErrorNone {
	FailureDefinitionId^ get ();
}
static member GenericErrorNone : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace